zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc01/pic32ck2051gc01144-pinctrl.h
#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

#define PB4C_SERCOM4_PAD0 MCHP_PINMUX(b, 4, c, periph)

#define PB4F_TCC0_WO0 MCHP_PINMUX(b, 4, f, periph)

#define PB4G_PDEC_QDI0 MCHP_PINMUX(b, 4, g, periph)

#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

#define PB5C_SERCOM4_PAD1 MCHP_PINMUX(b, 5, c, periph)

#define PB5E_EBI_D12 MCHP_PINMUX(b, 5, e, periph)

#define PB5F_TCC0_WO1 MCHP_PINMUX(b, 5, f, periph)

#define PB5G_PDEC_QDI1 MCHP_PINMUX(b, 5, g, periph)

#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

#define PB6C_SERCOM4_PAD3 MCHP_PINMUX(b, 6, c, periph)

#define PB6E_EBI_D14 MCHP_PINMUX(b, 6, e, periph)

#define PB6F_TCC0_WO3 MCHP_PINMUX(b, 6, f, periph)

#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

#define PB7C_SERCOM3_PAD2 MCHP_PINMUX(b, 7, c, periph)

#define PB7D_SERCOM4_PAD2 MCHP_PINMUX(b, 7, d, periph)

#define PB7E_EBI_NBS1_NWR1 MCHP_PINMUX(b, 7, e, periph)

#define PB7F_TCC7_WO0 MCHP_PINMUX(b, 7, f, periph)

#define PB7G_PDEC_QDI0 MCHP_PINMUX(b, 7, g, periph)

#define PB7I_SDMMC1_SDCMD MCHP_PINMUX(b, 7, i, periph)

#define PB7K_PCC_DATA3 MCHP_PINMUX(b, 7, k, periph)

#define PB7M_CCL_IN0 MCHP_PINMUX(b, 7, m, periph)

#define PB7N_PTC_DRV6 MCHP_PINMUX(b, 7, n, periph)

#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

#define PB8C_SERCOM3_PAD3 MCHP_PINMUX(b, 8, c, periph)

#define PB8D_SERCOM4_PAD3 MCHP_PINMUX(b, 8, d, periph)

#define PB8E_EBI_NBS0_A0 MCHP_PINMUX(b, 8, e, periph)

#define PB8F_TCC7_WO1 MCHP_PINMUX(b, 8, f, periph)

#define PB8G_PDEC_QDI1 MCHP_PINMUX(b, 8, g, periph)

#define PB8H_CAN0_TX MCHP_PINMUX(b, 8, h, periph)

#define PB8K_PCC_DATA4 MCHP_PINMUX(b, 8, k, periph)

#define PB8M_CCL_IN1 MCHP_PINMUX(b, 8, m, periph)

#define PB8N_PTC_DRV7 MCHP_PINMUX(b, 8, n, periph)

#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

#define PB9C_SERCOM4_PAD0 MCHP_PINMUX(b, 9, c, periph)

#define PB9D_SERCOM4_PAD1 MCHP_PINMUX(b, 9, d, periph)

#define PB9E_EBI_A15 MCHP_PINMUX(b, 9, e, periph)

#define PB9G_PDEC_QDI2 MCHP_PINMUX(b, 9, g, periph)

#define PB9H_CAN0_RX MCHP_PINMUX(b, 9, h, periph)

#define PB9K_PCC_DATA5 MCHP_PINMUX(b, 9, k, periph)

#define PB9M_CCL_IN2 MCHP_PINMUX(b, 9, m, periph)

#define PB9N_PTC_DRV8 MCHP_PINMUX(b, 9, n, periph)

#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

#define PB10C_SERCOM4_PAD1 MCHP_PINMUX(b, 10, c, periph)

#define PB10D_SERCOM4_PAD0 MCHP_PINMUX(b, 10, d, periph)

#define PB10E_EBI_A14 MCHP_PINMUX(b, 10, e, periph)

#define PB10G_TCC0_WO0 MCHP_PINMUX(b, 10, g, periph)

#define PB10I_SDMMC1_SDDAT0 MCHP_PINMUX(b, 10, i, periph)

#define PB10K_PCC_DATA6 MCHP_PINMUX(b, 10, k, periph)

#define PB10L_ETH_MDC MCHP_PINMUX(b, 10, l, periph)

#define PB10M_CCL_OUT0 MCHP_PINMUX(b, 10, m, periph)

#define PB10N_PTC_DRV9 MCHP_PINMUX(b, 10, n, periph)

#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

#define PB11B_ADC_VINP10 MCHP_PINMUX(b, 11, b, periph)

#define PB11E_EBI_D10 MCHP_PINMUX(b, 11, e, periph)

#define PB11G_TCC3_WO6 MCHP_PINMUX(b, 11, g, periph)

#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

#define PB12A_EIC_EXTINT12 MCHP_PINMUX(b, 12, a, periph)

#define PB12B_ADC_VINP11 MCHP_PINMUX(b, 12, b, periph)

#define PB12C_SERCOM4_PAD0 MCHP_PINMUX(b, 12, c, periph)

#define PB12D_SERCOM7_PAD1 MCHP_PINMUX(b, 12, d, periph)

#define PB12E_EBI_D11 MCHP_PINMUX(b, 12, e, periph)

#define PB12F_TCC4_WO0 MCHP_PINMUX(b, 12, f, periph)

#define PB12G_TCC3_WO7 MCHP_PINMUX(b, 12, g, periph)

#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

#define PB13A_EIC_EXTINT13 MCHP_PINMUX(b, 13, a, periph)

#define PB13C_SERCOM4_PAD2 MCHP_PINMUX(b, 13, c, periph)

#define PB13E_EBI_D13 MCHP_PINMUX(b, 13, e, periph)

#define PB13F_TCC0_WO2 MCHP_PINMUX(b, 13, f, periph)

#define PB13G_PDEC_QDI2 MCHP_PINMUX(b, 13, g, periph)

#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

#define PB14A_EIC_EXTINT14 MCHP_PINMUX(b, 14, a, periph)

#define PB14E_EBI_D15 MCHP_PINMUX(b, 14, e, periph)

#define PB14F_TCC0_WO4 MCHP_PINMUX(b, 14, f, periph)

#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

#define PB15A_EIC_EXTINT15 MCHP_PINMUX(b, 15, a, periph)

#define PB15E_EBI_NRD MCHP_PINMUX(b, 15, e, periph)

#define PB15F_TCC0_WO5 MCHP_PINMUX(b, 15, f, periph)

#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

#define PB16A_EIC_EXTINT0 MCHP_PINMUX(b, 16, a, periph)

#define PB16C_SERCOM3_PAD0 MCHP_PINMUX(b, 16, c, periph)

#define PB16F_TCC6_WO0 MCHP_PINMUX(b, 16, f, periph)

#define PB16H_CAN0_TX MCHP_PINMUX(b, 16, h, periph)

#define PB16N_PTC_DRV24 MCHP_PINMUX(b, 16, n, periph)

#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

#define PB17C_SERCOM3_PAD1 MCHP_PINMUX(b, 17, c, periph)

#define PB17F_TCC6_WO1 MCHP_PINMUX(b, 17, f, periph)

#define PB17H_CAN0_RX MCHP_PINMUX(b, 17, h, periph)

#define PB17N_PTC_DRV25 MCHP_PINMUX(b, 17, n, periph)

#define PB18_GPIO MCHP_PINMUX(b, 18, gpio, gpio)

#define PB18A_EIC_EXTINT2 MCHP_PINMUX(b, 18, a, periph)

#define PB18C_SERCOM4_PAD1 MCHP_PINMUX(b, 18, c, periph)

#define PB18D_SERCOM7_PAD0 MCHP_PINMUX(b, 18, d, periph)

#define PB18F_TCC4_WO1 MCHP_PINMUX(b, 18, f, periph)

#define PB18K_PCC_DATA8 MCHP_PINMUX(b, 18, k, periph)

#define PB19_GPIO MCHP_PINMUX(b, 19, gpio, gpio)

#define PB19A_EIC_EXTINT3 MCHP_PINMUX(b, 19, a, periph)

#define PB19C_SERCOM4_PAD2 MCHP_PINMUX(b, 19, c, periph)

#define PB19D_SERCOM7_PAD2 MCHP_PINMUX(b, 19, d, periph)

#define PB19F_TCC5_WO0 MCHP_PINMUX(b, 19, f, periph)

#define PB19K_PCC_DATA9 MCHP_PINMUX(b, 19, k, periph)

#define PB20_GPIO MCHP_PINMUX(b, 20, gpio, gpio)

#define PB20A_EIC_EXTINT4 MCHP_PINMUX(b, 20, a, periph)

#define PB20C_SERCOM4_PAD3 MCHP_PINMUX(b, 20, c, periph)

