zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc01/pic32ck2051gc01144-pinctrl.h
#define PB20D_SERCOM7_PAD3 MCHP_PINMUX(b, 20, d, periph)

#define PB20F_TCC5_WO1 MCHP_PINMUX(b, 20, f, periph)

#define PB20K_PCC_DATA10 MCHP_PINMUX(b, 20, k, periph)

#define PB21_GPIO MCHP_PINMUX(b, 21, gpio, gpio)

#define PB21A_EIC_EXTINT5 MCHP_PINMUX(b, 21, a, periph)

#define PB21C_SERCOM3_PAD0 MCHP_PINMUX(b, 21, c, periph)

#define PB21E_EBI_A22 MCHP_PINMUX(b, 21, e, periph)

#define PB21F_TCC0_WO6 MCHP_PINMUX(b, 21, f, periph)

#define PB21H_CAN0_TX MCHP_PINMUX(b, 21, h, periph)

#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

#define PB22C_SERCOM3_PAD1 MCHP_PINMUX(b, 22, c, periph)

#define PB22E_EBI_A21 MCHP_PINMUX(b, 22, e, periph)

#define PB22F_TCC0_WO7 MCHP_PINMUX(b, 22, f, periph)

#define PB22H_CAN0_RX MCHP_PINMUX(b, 22, h, periph)

#define PB22M_CCL_IN0 MCHP_PINMUX(b, 22, m, periph)

#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

#define PB23C_SERCOM3_PAD2 MCHP_PINMUX(b, 23, c, periph)

#define PB23E_EBI_A20 MCHP_PINMUX(b, 23, e, periph)

#define PB23F_TCC6_WO0 MCHP_PINMUX(b, 23, f, periph)

#define PB23H_CAN1_TX MCHP_PINMUX(b, 23, h, periph)

#define PB23M_CCL_IN1 MCHP_PINMUX(b, 23, m, periph)

#define PB24_GPIO MCHP_PINMUX(b, 24, gpio, gpio)

#define PB24A_EIC_EXTINT8 MCHP_PINMUX(b, 24, a, periph)

#define PB24C_SERCOM3_PAD3 MCHP_PINMUX(b, 24, c, periph)

#define PB24E_EBI_A19 MCHP_PINMUX(b, 24, e, periph)

#define PB24F_TCC6_WO1 MCHP_PINMUX(b, 24, f, periph)

#define PB24H_CAN1_RX MCHP_PINMUX(b, 24, h, periph)

#define PB24M_CCL_IN2 MCHP_PINMUX(b, 24, m, periph)

#define PB25_GPIO MCHP_PINMUX(b, 25, gpio, gpio)

#define PB25A_EIC_EXTINT9 MCHP_PINMUX(b, 25, a, periph)

#define PB25E_EBI_A18 MCHP_PINMUX(b, 25, e, periph)

#define PB25F_TCC7_WO0 MCHP_PINMUX(b, 25, f, periph)

#define PB25M_CCL_OUT0 MCHP_PINMUX(b, 25, m, periph)

#define PB26_GPIO MCHP_PINMUX(b, 26, gpio, gpio)

#define PB26A_EIC_EXTINT10 MCHP_PINMUX(b, 26, a, periph)

#define PB26F_TCC7_WO1 MCHP_PINMUX(b, 26, f, periph)

#define PB26K_PCC_DATA11 MCHP_PINMUX(b, 26, k, periph)

#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

#define PC0C_SERCOM4_PAD2 MCHP_PINMUX(c, 0, c, periph)

#define PC0E_EBI_A13 MCHP_PINMUX(c, 0, e, periph)

#define PC0G_TCC0_WO1 MCHP_PINMUX(c, 0, g, periph)

#define PC0I_SDMMC1_SDDAT1 MCHP_PINMUX(c, 0, i, periph)

#define PC0K_PCC_DATA7 MCHP_PINMUX(c, 0, k, periph)

#define PC0L_ETH_REF_CLK MCHP_PINMUX(c, 0, l, periph)

#define PC0L_ETH_TX_CLK MCHP_PINMUX(c, 0, l, periph)

#define PC0M_GCLK_IO2 MCHP_PINMUX(c, 0, m, periph)

#define PC0N_PTC_DRV10 MCHP_PINMUX(c, 0, n, periph)

#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

#define PC1C_SERCOM4_PAD3 MCHP_PINMUX(c, 1, c, periph)

#define PC1E_EBI_A12 MCHP_PINMUX(c, 1, e, periph)

#define PC1F_TCC6_WO0 MCHP_PINMUX(c, 1, f, periph)

#define PC1G_TCC0_WO2 MCHP_PINMUX(c, 1, g, periph)

#define PC1H_USB_SOF_1KHZ MCHP_PINMUX(c, 1, h, periph)

#define PC1I_SDMMC1_SDDAT2 MCHP_PINMUX(c, 1, i, periph)

#define PC1K_PCC_DATA0 MCHP_PINMUX(c, 1, k, periph)

#define PC1M_GCLK_IO3 MCHP_PINMUX(c, 1, m, periph)

#define PC1N_PTC_DRV11 MCHP_PINMUX(c, 1, n, periph)

#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

#define PC2A_EIC_EXTINT2 MCHP_PINMUX(c, 2, a, periph)

#define PC2C_SERCOM3_PAD0 MCHP_PINMUX(c, 2, c, periph)

#define PC2E_EBI_A11 MCHP_PINMUX(c, 2, e, periph)

#define PC2F_TCC6_WO1 MCHP_PINMUX(c, 2, f, periph)

#define PC2G_TCC0_WO3 MCHP_PINMUX(c, 2, g, periph)

#define PC2H_CAN0_TX MCHP_PINMUX(c, 2, h, periph)

#define PC2I_SDMMC1_SDDAT3 MCHP_PINMUX(c, 2, i, periph)

#define PC2K_PCC_DATA1 MCHP_PINMUX(c, 2, k, periph)

#define PC2L_ETH_MDIO MCHP_PINMUX(c, 2, l, periph)

#define PC2M_GCLK_IO4 MCHP_PINMUX(c, 2, m, periph)

#define PC2N_PTC_DRV12 MCHP_PINMUX(c, 2, n, periph)

#define PC3_GPIO MCHP_PINMUX(c, 3, gpio, gpio)

#define PC3A_EIC_EXTINT3 MCHP_PINMUX(c, 3, a, periph)

#define PC3C_SERCOM3_PAD1 MCHP_PINMUX(c, 3, c, periph)

#define PC3E_EBI_A10 MCHP_PINMUX(c, 3, e, periph)

#define PC3F_TCC7_WO0 MCHP_PINMUX(c, 3, f, periph)

#define PC3G_TCC0_WO4 MCHP_PINMUX(c, 3, g, periph)

#define PC3H_CAN0_RX MCHP_PINMUX(c, 3, h, periph)

#define PC3I_SDMMC1_SDWP MCHP_PINMUX(c, 3, i, periph)

#define PC3K_PCC_DATA2 MCHP_PINMUX(c, 3, k, periph)

#define PC3L_ETH_MDC MCHP_PINMUX(c, 3, l, periph)

#define PC3M_GCLK_IO5 MCHP_PINMUX(c, 3, m, periph)

#define PC3N_PTC_DRV13 MCHP_PINMUX(c, 3, n, periph)

#define PC4_GPIO MCHP_PINMUX(c, 4, gpio, gpio)

#define PC4A_EIC_EXTINT4 MCHP_PINMUX(c, 4, a, periph)

#define PC4C_SERCOM3_PAD2 MCHP_PINMUX(c, 4, c, periph)

#define PC4E_EBI_A9 MCHP_PINMUX(c, 4, e, periph)

#define PC4F_TCC7_WO1 MCHP_PINMUX(c, 4, f, periph)

#define PC4G_TCC0_WO5 MCHP_PINMUX(c, 4, g, periph)

#define PC4I_SDMMC1_SDCD MCHP_PINMUX(c, 4, i, periph)

#define PC4K_PCC_DEN1 MCHP_PINMUX(c, 4, k, periph)

#define PC4L_ETH_MDIO MCHP_PINMUX(c, 4, l, periph)

#define PC4M_GCLK_IO6 MCHP_PINMUX(c, 4, m, periph)

#define PC4N_PTC_DRV14 MCHP_PINMUX(c, 4, n, periph)

#define PC5_GPIO MCHP_PINMUX(c, 5, gpio, gpio)

#define PC5A_EIC_EXTINT5 MCHP_PINMUX(c, 5, a, periph)

#define PC5C_SERCOM3_PAD3 MCHP_PINMUX(c, 5, c, periph)

#define PC5E_EBI_A7 MCHP_PINMUX(c, 5, e, periph)

#define PC5G_TCC1_WO0 MCHP_PINMUX(c, 5, g, periph)

#define PC5I_SDMMC1_SDCK MCHP_PINMUX(c, 5, i, periph)

#define PC5K_PCC_CLK MCHP_PINMUX(c, 5, k, periph)

#define PC5L_ETH_RXD2 MCHP_PINMUX(c, 5, l, periph)

#define PC5M_GCLK_IO7 MCHP_PINMUX(c, 5, m, periph)

#define PC5N_PTC_DRV15 MCHP_PINMUX(c, 5, n, periph)

#define PC6_GPIO MCHP_PINMUX(c, 6, gpio, gpio)

#define PC6A_EIC_EXTINT6 MCHP_PINMUX(c, 6, a, periph)

#define PC6B_AC_AIN2 MCHP_PINMUX(c, 6, b, periph)

#define PC6C_SERCOM2_PAD0 MCHP_PINMUX(c, 6, c, periph)

#define PC6D_SERCOM3_PAD1 MCHP_PINMUX(c, 6, d, periph)

#define PC6G_TCC1_WO1 MCHP_PINMUX(c, 6, g, periph)

#define PC6H_CAN1_TX MCHP_PINMUX(c, 6, h, periph)

#define PC6L_ETH_RXD1 MCHP_PINMUX(c, 6, l, periph)

#define PC6N_PTC_DRV16 MCHP_PINMUX(c, 6, n, periph)

#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

#define PC7A_EIC_EXTINT7 MCHP_PINMUX(c, 7, a, periph)

