zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc01/pic32ck2051gc01144-pinctrl.h
#define PC22K_PCC_DATA13 MCHP_PINMUX(c, 22, k, periph)

#define PC22M_AC_CMP1 MCHP_PINMUX(c, 22, m, periph)

#define PC23_GPIO MCHP_PINMUX(c, 23, gpio, gpio)

#define PC23A_EIC_EXTINT7 MCHP_PINMUX(c, 23, a, periph)

#define PC23C_SERCOM2_PAD3 MCHP_PINMUX(c, 23, c, periph)

#define PC23E_EBI_NCS1 MCHP_PINMUX(c, 23, e, periph)

#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

#define PC24E_EBI_NWE_NWR0 MCHP_PINMUX(c, 24, e, periph)

#define PC24M_CCL_IN3 MCHP_PINMUX(c, 24, m, periph)

#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

#define PC25A_EIC_EXTINT9 MCHP_PINMUX(c, 25, a, periph)

#define PC25E_EBI_NCS0 MCHP_PINMUX(c, 25, e, periph)

#define PC25M_CCL_IN4 MCHP_PINMUX(c, 25, m, periph)

#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

#define PC26A_EIC_EXTINT10 MCHP_PINMUX(c, 26, a, periph)

#define PC26C_SERCOM2_PAD3 MCHP_PINMUX(c, 26, c, periph)

#define PC26E_EBI_A17 MCHP_PINMUX(c, 26, e, periph)

#define PC26M_CCL_IN5 MCHP_PINMUX(c, 26, m, periph)

#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

#define PC27E_EBI_A16 MCHP_PINMUX(c, 27, e, periph)

#define PC27M_CCL_OUT1 MCHP_PINMUX(c, 27, m, periph)

#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

#define PC28E_EBI_A23 MCHP_PINMUX(c, 28, e, periph)

#define PC28F_TCC1_WO6 MCHP_PINMUX(c, 28, f, periph)

#define PC29_GPIO MCHP_PINMUX(c, 29, gpio, gpio)

#define PC29A_EIC_EXTINT13 MCHP_PINMUX(c, 29, a, periph)

#define PC29E_EBI_NCS2 MCHP_PINMUX(c, 29, e, periph)

#define PC29F_TCC1_WO7 MCHP_PINMUX(c, 29, f, periph)

#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

#define PD2A_EIC_NMI MCHP_PINMUX(d, 2, a, periph)

#define PD2E_EBI_A19 MCHP_PINMUX(d, 2, e, periph)

#define PD2H_USB_SOF_1KHZ MCHP_PINMUX(d, 2, h, periph)

#define PD2K_PCC_DEN2 MCHP_PINMUX(d, 2, k, periph)

#define PD2L_ETH_TSUCOMP MCHP_PINMUX(d, 2, l, periph)

#define PD3_GPIO MCHP_PINMUX(d, 3, gpio, gpio)

#define PD3A_EIC_EXTINT3 MCHP_PINMUX(d, 3, a, periph)

#define PD3H_USB_DM MCHP_PINMUX(d, 3, h, periph)

#define PD4_GPIO MCHP_PINMUX(d, 4, gpio, gpio)

#define PD4A_EIC_EXTINT4 MCHP_PINMUX(d, 4, a, periph)

#define PD4H_USB_DP MCHP_PINMUX(d, 4, h, periph)

#define PD5_GPIO MCHP_PINMUX(d, 5, gpio, gpio)

#define PD5A_EIC_EXTINT5 MCHP_PINMUX(d, 5, a, periph)

#define PD5C_SERCOM0_PAD2 MCHP_PINMUX(d, 5, c, periph)

#define PD5E_EBI_NWE_NWR0 MCHP_PINMUX(d, 5, e, periph)

#define PD5G_TCC2_WO0 MCHP_PINMUX(d, 5, g, periph)

#define PD5H_SQI_CS1 MCHP_PINMUX(d, 5, h, periph)

#define PD5I_SDMMC0_SDWP MCHP_PINMUX(d, 5, i, periph)

#define PD5M_GCLK_IO3 MCHP_PINMUX(d, 5, m, periph)

#define PD6_GPIO MCHP_PINMUX(d, 6, gpio, gpio)

#define PD6A_EIC_EXTINT6 MCHP_PINMUX(d, 6, a, periph)

#define PD6C_SERCOM0_PAD0 MCHP_PINMUX(d, 6, c, periph)

#define PD6E_EBI_A18 MCHP_PINMUX(d, 6, e, periph)

#define PD6F_TCC2_WO4 MCHP_PINMUX(d, 6, f, periph)

#define PD6G_TCC2_WO1 MCHP_PINMUX(d, 6, g, periph)

#define PD6H_SQI_CS0 MCHP_PINMUX(d, 6, h, periph)

#define PD6I_SDMMC0_SDCMD MCHP_PINMUX(d, 6, i, periph)

#define PD6J_SPI_IXS_FSYNC MCHP_PINMUX(d, 6, j, periph)

#define PD6L_ETH_MDIO MCHP_PINMUX(d, 6, l, periph)

#define PD6M_GCLK_IO4 MCHP_PINMUX(d, 6, m, periph)

#define PD7_GPIO MCHP_PINMUX(d, 7, gpio, gpio)

#define PD7A_EIC_EXTINT7 MCHP_PINMUX(d, 7, a, periph)

#define PD7C_SERCOM0_PAD1 MCHP_PINMUX(d, 7, c, periph)

#define PD7E_EBI_A17 MCHP_PINMUX(d, 7, e, periph)

#define PD7F_TCC2_WO5 MCHP_PINMUX(d, 7, f, periph)

#define PD7G_TCC2_WO2 MCHP_PINMUX(d, 7, g, periph)

#define PD7H_SQI_DATA0 MCHP_PINMUX(d, 7, h, periph)

#define PD7I_SDMMC0_SDDAT0 MCHP_PINMUX(d, 7, i, periph)

#define PD7J_SPI_IXS_SDI MCHP_PINMUX(d, 7, j, periph)

#define PD7L_ETH_MDC MCHP_PINMUX(d, 7, l, periph)

#define PD7M_GCLK_IO5 MCHP_PINMUX(d, 7, m, periph)

#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

#define PD8A_EIC_EXTINT8 MCHP_PINMUX(d, 8, a, periph)

#define PD8C_SERCOM1_PAD0 MCHP_PINMUX(d, 8, c, periph)

#define PD8E_EBI_A16 MCHP_PINMUX(d, 8, e, periph)

#define PD8G_TCC2_WO3 MCHP_PINMUX(d, 8, g, periph)

#define PD8H_SQI_DATA2 MCHP_PINMUX(d, 8, h, periph)

#define PD8I_SDMMC0_SDDAT2 MCHP_PINMUX(d, 8, i, periph)

#define PD8J_SPI_IXS_SDO MCHP_PINMUX(d, 8, j, periph)

#define PD8M_CCL_IN6 MCHP_PINMUX(d, 8, m, periph)

#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

#define PD9A_EIC_EXTINT9 MCHP_PINMUX(d, 9, a, periph)

#define PD9C_SERCOM1_PAD1 MCHP_PINMUX(d, 9, c, periph)

#define PD9E_EBI_NCS1 MCHP_PINMUX(d, 9, e, periph)

#define PD9G_TCC2_WO4 MCHP_PINMUX(d, 9, g, periph)

#define PD9H_SQI_DATA3 MCHP_PINMUX(d, 9, h, periph)

#define PD9I_SDMMC0_SDDAT3 MCHP_PINMUX(d, 9, i, periph)

#define PD9M_CCL_IN7 MCHP_PINMUX(d, 9, m, periph)

#define PD10_GPIO MCHP_PINMUX(d, 10, gpio, gpio)

#define PD10A_EIC_EXTINT10 MCHP_PINMUX(d, 10, a, periph)

#define PD10C_SERCOM1_PAD2 MCHP_PINMUX(d, 10, c, periph)

#define PD10G_TCC2_WO5 MCHP_PINMUX(d, 10, g, periph)

#define PD10H_SQI_CLK MCHP_PINMUX(d, 10, h, periph)

#define PD10I_SDMMC0_SDCK MCHP_PINMUX(d, 10, i, periph)

#define PD10J_SPI_IXS_SCK MCHP_PINMUX(d, 10, j, periph)

#define PD10M_CCL_IN8 MCHP_PINMUX(d, 10, m, periph)

#define PD11_GPIO MCHP_PINMUX(d, 11, gpio, gpio)

#define PD11A_EIC_EXTINT11 MCHP_PINMUX(d, 11, a, periph)

#define PD11C_SERCOM1_PAD3 MCHP_PINMUX(d, 11, c, periph)

#define PD11E_EBI_NWAIT MCHP_PINMUX(d, 11, e, periph)

#define PD11F_TCC2_WO2 MCHP_PINMUX(d, 11, f, periph)

#define PD11G_TCC2_WO6 MCHP_PINMUX(d, 11, g, periph)

#define PD11H_SQI_DATA1 MCHP_PINMUX(d, 11, h, periph)

#define PD11I_SDMMC0_SDDAT1 MCHP_PINMUX(d, 11, i, periph)

#define PD11M_CCL_OUT2 MCHP_PINMUX(d, 11, m, periph)

#define PD12_GPIO MCHP_PINMUX(d, 12, gpio, gpio)

#define PD12A_EIC_EXTINT12 MCHP_PINMUX(d, 12, a, periph)

#define PD12C_SERCOM0_PAD3 MCHP_PINMUX(d, 12, c, periph)

