zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc01/pic32ck2051gc01144-pinctrl.h
#define PD12E_EBI_NCS0 MCHP_PINMUX(d, 12, e, periph)

#define PD12F_TCC2_WO1 MCHP_PINMUX(d, 12, f, periph)

#define PD12G_TCC2_WO7 MCHP_PINMUX(d, 12, g, periph)

#define PD12H_SQI_CS3 MCHP_PINMUX(d, 12, h, periph)

#define PD12I_SDMMC0_SDCD MCHP_PINMUX(d, 12, i, periph)

#define PD12M_GCLK_IO2 MCHP_PINMUX(d, 12, m, periph)

#define PD13_GPIO MCHP_PINMUX(d, 13, gpio, gpio)

#define PD13A_EIC_EXTINT13 MCHP_PINMUX(d, 13, a, periph)

#define PD13C_SERCOM1_PAD0 MCHP_PINMUX(d, 13, c, periph)

#define PD13F_TCC2_WO6 MCHP_PINMUX(d, 13, f, periph)

#define PD13J_SPI_IXS_FSYNC MCHP_PINMUX(d, 13, j, periph)

#define PD14_GPIO MCHP_PINMUX(d, 14, gpio, gpio)

#define PD14A_EIC_EXTINT14 MCHP_PINMUX(d, 14, a, periph)

#define PD14C_SERCOM1_PAD1 MCHP_PINMUX(d, 14, c, periph)

#define PD14F_TCC2_WO7 MCHP_PINMUX(d, 14, f, periph)

#define PD14J_SPI_IXS_SCK MCHP_PINMUX(d, 14, j, periph)

#define PD15_GPIO MCHP_PINMUX(d, 15, gpio, gpio)

#define PD15A_EIC_EXTINT15 MCHP_PINMUX(d, 15, a, periph)

#define PD15C_SERCOM1_PAD2 MCHP_PINMUX(d, 15, c, periph)

#define PD15E_EBI_NCS3 MCHP_PINMUX(d, 15, e, periph)

#define PD16_GPIO MCHP_PINMUX(d, 16, gpio, gpio)

#define PD16A_EIC_EXTINT0 MCHP_PINMUX(d, 16, a, periph)

#define PD16C_SERCOM1_PAD3 MCHP_PINMUX(d, 16, c, periph)

#define PD16J_SPI_IXS_SDI MCHP_PINMUX(d, 16, j, periph)

#define PD16L_ETH_TSUCOMP MCHP_PINMUX(d, 16, l, periph)

#define PD17_GPIO MCHP_PINMUX(d, 17, gpio, gpio)

#define PD17A_EIC_EXTINT1 MCHP_PINMUX(d, 17, a, periph)

#define PD17C_SERCOM0_PAD0 MCHP_PINMUX(d, 17, c, periph)

#define PD17J_SPI_IXS_SDO MCHP_PINMUX(d, 17, j, periph)

#define PD17M_CCL_IN6 MCHP_PINMUX(d, 17, m, periph)

#define PD18_GPIO MCHP_PINMUX(d, 18, gpio, gpio)

#define PD18A_EIC_EXTINT2 MCHP_PINMUX(d, 18, a, periph)

#define PD18C_SERCOM0_PAD1 MCHP_PINMUX(d, 18, c, periph)

#define PD18H_CAN0_TX MCHP_PINMUX(d, 18, h, periph)

#define PD18M_CCL_IN7 MCHP_PINMUX(d, 18, m, periph)

#define PD19_GPIO MCHP_PINMUX(d, 19, gpio, gpio)

#define PD19A_EIC_EXTINT3 MCHP_PINMUX(d, 19, a, periph)

#define PD19C_SERCOM0_PAD2 MCHP_PINMUX(d, 19, c, periph)

#define PD19H_CAN0_RX MCHP_PINMUX(d, 19, h, periph)

#define PD19K_PCC_DEN1 MCHP_PINMUX(d, 19, k, periph)

#define PD19M_CCL_IN8 MCHP_PINMUX(d, 19, m, periph)

#define PD20_GPIO MCHP_PINMUX(d, 20, gpio, gpio)

#define PD20A_EIC_EXTINT4 MCHP_PINMUX(d, 20, a, periph)

#define PD20C_SERCOM0_PAD3 MCHP_PINMUX(d, 20, c, periph)

#define PD20H_CAN1_TX MCHP_PINMUX(d, 20, h, periph)

#define PD20K_PCC_DEN2 MCHP_PINMUX(d, 20, k, periph)

#define PD20M_CCL_OUT2 MCHP_PINMUX(d, 20, m, periph)

#define PD21_GPIO MCHP_PINMUX(d, 21, gpio, gpio)

#define PD21A_EIC_EXTINT5 MCHP_PINMUX(d, 21, a, periph)

#define PD21H_CAN1_RX MCHP_PINMUX(d, 21, h, periph)

#endif /* MICROCHIP_PIC32CK2051GC01144_PINCTRL_H_ */
